module.exports = (function (arr) {
    return arr.map(
        (心に残る言葉) =>
            `昔${心に残る言葉[0]}{前面垫话}、「${心に残る言葉[1]}」{后面垫话}`
    );
})([
    [
        "アリストテレス",
        '"垣根"は相手が作っているのではなく、自分が作っている。',
    ],
    ["加賀見俊夫", '"足して２で割る"案は最悪になる。'],
    [
        "夏目漱石",
        "「ああ、ここにおれの進むべき道があった！ようやく掘り当てた！」こういう感投詞を心の底から叫び出される時、貴方がたははじめて心を安んずる事ができるのだろう。",
    ],
    [
        "メーソン・クーリー",
        "「それも、いいじゃないか」は、おもしろい人生のスローガン。",
    ],
    [
        "野中日文",
        "「一喜一憂」をのぞいて我々の人生にいったい何が残るというのか？",
    ],
    [
        "Ａ・シリトー",
        "「運」ってやつは、たえず変わる。いま後頭部にがんと一撃くらわせたかと思うと、次の瞬間には砂糖をほおばらせてくれたりする。問題はただひとつ、へこたれてしまわないことだ。",
    ],
    [
        "久保田美文",
        "「己の長を以って人の短をあらわすなかれ」人は往々にして自分の長所を標準として他人の短所を責めがちなんだ。",
    ],
    [
        "ギタ・ベリン",
        "「私は～しなければならない」と私たちが言う時はいつも、実際にそれをやる場合より、すっと多くのエネルギーを消耗しているのだ。",
    ],
    [
        "萩原朔太郎",
        "「真面目になる」ということは、しばしば「憂鬱になる」ということの外の、何のいい意味でもありはしない。",
    ],
    [
        "ブライアン・アダムス",
        "１つのドアが閉まれば、もう１つのドアが必ず開きます。それはバランスをとるための、自然の法則なのだ。",
    ],
    [
        "ジミー・コーナーズ",
        "１試合にわたって集中力を維持するためには、適度にリラックスすることが絶対に必要だと思う。",
    ],
    [
        "ゲーテ",
        "３０分ぐらいでは何もできないと考えているより、世の中の一番つまらぬことでもする方がまさっている。",
    ],
    ["湯川秀樹", "アイデアの秘訣は執念である。"],
    ["チャップリン", "アイデアは、それを一心に求めてさえいれば必ず生まれる。"],
    ["ホラティウス", "あきらめてしまうと、癒しようのない不幸も和らげる。"],
    ["河合隼雄", "あくる朝起きたら、また違う風が吹いているからね。"],
    [
        "シェイクスピア",
        "貴方がたとえ氷のように潔癖で雪のように潔白であろうとも、世の悪口はまぬがれまい。",
    ],
    [
        "アインシュタイン",
        "貴方がたの人間性を心にとどめ、そして他のことを忘れよ。",
    ],
    [
        "エマーソン",
        "貴方が今、夢中になっているものを大切にしなさい。それは貴方が真に求めているものだから。",
    ],
    [
        "ダグ・マハーショルド",
        "貴方が持ち合わせた力に余る強さなど、人生は要求しない。貴方にたて得るただひとつの手柄は、そこから逃げないこと。",
    ],
    [
        "マルコム・フォーブズ",
        "貴方が成すべきことを成さねばならないのなら、したいことをするための賢明さも持たなくてはならない。",
    ],
    ["カフカ", "貴方と世の中との戦いなら、世の中のほうに賭けなさい。"],
    [
        "マーフィー",
        "貴方に配られたトランプのカードは不利ではない。貴方の考えや感情が不利にも有利にも作用するのだ。",
    ],
    [
        "マーフィー",
        "貴方の考えが積極的で、建設的で愛に満ちていれば正しい結論は必然的に得られます。",
    ],
    [
        "ブライアン・アダムス",
        "貴方の周りを変えようとしてもほとんど意味がない。まず最初に、自分の信念を変えなさい。そうすれば、貴方の周りのあらゆることがそれに応じて、変わる。",
    ],
    ["ドン・シベット", "貴方の心からくるものは、人の心を動かす。"],
    [
        "エリノア・ルーズベルト",
        "貴方の心が正しいと感じることを行いなさい。行なえば非難されるだろうが、行なわなければ、やはり非難されるのだから。",
    ],
    [
        "デニス・ウェイトリー",
        "貴方の進歩を妨げているのは、貴方が何であるかではなく、貴方が自分を何だと思っているかである。",
    ],
    [
        "マーフィー",
        "貴方の人生は貴方の思いどおりに変えられる。なぜなら貴方自身によってデザインされるのが貴方の人生だからだ。",
    ],
    [
        "イグナス・バーンスタイン",
        "貴方の知る最善をなせ。もし貴方がランナーであれば走れ、鐘であれば鳴れ。",
    ],
    [
        "マーフィー",
        "貴方は他人の責任をとる必要はない。貴方が他人に対して負っていることといえば、それは愛と善意だ。",
    ],
    [
        "ヘリゲル",
        "貴方は無心になろうと努めている。つまり貴方は故意に無心なのである。それではこれ以上進むはずがない。",
    ],
    [
        "Ｅ・Ｍ・フォースター",
        "あまり人を理解できるとは思わない。わかるのは、好きか嫌いかだけだ。",
    ],
    [
        "レオ・Ｃ・ローステン",
        "あまり多くを求めないことだ。とくに他人に対しては。",
    ],
    ["北畠親房", "あめつちの初めは今日より始まる。"],
    [
        "ビクトル・ユーゴー",
        "あらあらしい毒づいた言葉は、根拠の弱いものであることが多い。",
    ],
    [
        "スピノザ",
        "ありあまるほど自由な時間のある人間は、たいてい悪いことを考えるものである。",
    ],
    ["セネカ", "過去はもはや関係がなく、未来はまだ来ぬ。"],
    [
        "井上ひさし",
        "ある選択をするということは、その選択によって生まれるはずのマイナスをすべて背負うぞ、ということでやんしょ。",
    ],
    [
        "尾崎士郎",
        "あれもいい、これもいいという生き方はどこにもねえや。あっちがよけりゃこっちが悪いに決まっているのだから、これだと思ったときに盲滅法に進まなけりゃ嘘だよ。",
    ],
    ["シェイクスピア", "貴方の遊びに言い訳はいらない。言い訳を決して言うな。"],
    [
        "マーフィー",
        "いかなるものも変化しつつある。これは真理だ。だから貴方がいまどんな苦境にあろうとも、その状態を保持する努力をしない限り、永久に続くはずはないのだ。",
    ],
    [
        "トルストイ",
        "いかなる時でも、お辞儀はし足りないよりも、し過ぎたほうがいい。",
    ],
    [
        "春日潜庵",
        "いかに弱き人といえども、その全力を単一の目的に集中すれば必ずその事を成し得べし。",
    ],
    ["高野泰明", "いかんものは、いくら考えてもよくならん。"],
    [
        "松下幸之助",
        "いくら粉飾したところで、自分の生地は誤魔化し切れない。正直こそが、処世の一番安全な道。",
    ],
    [
        "豊田佐吉",
        "いくら儲けたいの、いくら儲けねばならんのと、そんな横着な考えでは人間生きてゆけるものではない。",
    ],
    ["徳川家康", "いさめてくれる部下は、一番槍をする勇士より値打ちがある。"],
    ["吉田兼好", "いずかたをも捨てじと心にとり持ちては、一事もなるべからず。"],
    ["道元", "いたずらに過ごす月日の多けれど、道を求める時ぞ少なき。"],
    [
        "ハケット",
        "いつまでも人を恨んでいてはならない。貴方が恨んでいる人は、人生を楽しんでいる。",
    ],
    [
        "ジョシュア・リーブマン",
        "いつまで一緒にいられるか分からないということをしっかり心にとめてお互いを大切にしよう。",
    ],
    [
        "ロバート・ルイス・スティーブンソン（英 小説家）",
        "いつも楽しく暮らすよう心がければ、外的環境から完全にあるいはほとんど解放される。",
    ],
    [
        "マザー・テレサ",
        "いまの世の中、人間が人間を見捨てているのよね。親が子を、子が親を、兄が弟を、友が友を、隣人が隣人を。",
    ],
    ["二葉亭四迷", "いや、人生は気合だね。"],
    [
        "新渡戸稲造",
        "いわゆる十分に力を出す者に限って、おのれに十二分の力があり、十二分の力を出した者がおのれに十五分の力あることがわかってくる。",
    ],
    [
        "ラ・ロシュフーコー",
        "うぬぼれというものがついぞなかったら、人生はてんで楽しくあるまい。",
    ],
    [
        "Ｌ・Ｌ・コルベルト",
        "うまくいかなかった日は、寝る前に自問する。今ここで何かできることがあるのか、と。なければぐっすり寝る。",
    ],
    [
        "シェイクスピア",
        "うわべになにか「徳」のしるしをつけないような素直な「悪」はない。",
    ],
    [
        "フリードリヒ・ヘルデルリーン",
        "おお 人情に通じた人よ！彼は子どもたちの相手をするときは子どもっぽいしぐさをする。だが、樹木と子どもは、頭上のものを求めるものなのだ。",
    ],
    [
        "勝海舟",
        "おこないはおれのもの、批判は他人のもの、おれの知ったことじゃない。",
    ],
    [
        "マーフィー",
        "おだやかな心は問題を解決します。怒りにふるえ、悲しみに打ちひしがれ、嫉妬に狂った心は問題をますます混乱させます。問題の解決は心のおだやかな時にしなさい。",
    ],
    [
        "ワシントン",
        "おのれの職分を守り黙々として勤めることは、中傷に対する最上の答えである。",
    ],
    ["釈迦", "おのれの得るところを軽んずるなかれ。"],
    [
        "シェイクスピア",
        "お前は、他人のなかにある自分と同じ欠点をむち打とうとするのか。",
    ],
    [
        "高杉晋作",
        "おもしろきこともなき世をおもしろく　住みなすものは心なりけり。",
    ],
    [
        "Ｄ・カーネギー",
        "およそ人を扱う場合には、相手を論理の動物だと思ってはならない。相手は感情の動物であり、しかも偏見に満ち、自尊心と虚栄心によって行動するということを、よく心得ておかねばならない。",
    ],
    [
        "司馬遼太郎",
        "おれは、かつて、おれ自身に惚れこんだことがなかった。自分に惚れこみ、自分の才を信じて事を行えば、人の世に不運などはあるまい。",
    ],
    ["カーリル・ギブラン", "お互いに手をつなぐ時にも間をあけよう。"],
    [
        "シェイクスピア",
        "お前がそれを抑えつければ抑えつけるほど、ますます燃え上がるよ。静かにささやくように流れていく流れも、せき止められればカンシャクを起こしたように暴れ出すわね。だけどそのさわやかな流れが阻まれなければ、エナメルをかけた石に触れて快い音を奏でるわね。",
    ],
    [
        "ホラティウス",
        "お前の分別に一粒の愚かさを混ぜておきたまえ。時をみてばかなことをするのもよいことだ。",
    ],
    [
        "シェイクスピア",
        "お前は熊から、のがれようとしている。しかし、その途中で荒れ狂う大海に出会って、もう一度、獣の口のほうへ引きかえすのか？",
    ],
    [
        "本居宣長",
        "かぎりを行うのが人の道にして、そのことの成ると成らざるとは人の力におよばざるところぞ。",
    ],
    [
        "マーガレット・ロセッティ",
        "こういう無批判な愛は嬉しかった。それなら、こちらも惜しみなく愛してやれたから。",
    ],
    [
        "テレンティウス",
        "こういう曖昧なものを理屈できっぱりさせようなんてぇのは、理づめで気違いになろうてなもんだよ。",
    ],
    [
        "ジェームス三木",
        "こうしようか、ああしようか迷った時は、必ず積極的な方へいく。",
    ],
    [
        "ゲーテ",
        "ここで今これ以上骨を折っても無駄だ！バラならば、花咲くだろう。",
    ],
    ["シェイクスピア", "ことごとくの雲が嵐をなすというわけではない。"],
    ["一休", "この世にて慈悲も悪事もせぬ人は、さぞや閻魔も困りたまはん"],
    [
        "ウォルポール",
        "この世は、考える者にとっては喜劇であり、感じるものにとっては悲劇である。",
    ],
    ["モンテーニュ", "この世は絶え間のないシーソーだ。"],
    [
        "八尋舜右",
        "人生というものは、あらゆる規範からはなれ、もっと底抜けに自由であっていいはずだ。",
    ],
    [
        "一休",
        "この道を行けばどうなるものか、危ぶむなかれ、危ぶめば道はなし、踏み出せばその一歩が道となる、迷わずゆけよ、ゆけばわかる。",
    ],
    [
        "加藤楸邨",
        "この年になると、じっとしているだけで、うれしいことが向こうからやってくる。",
    ],
    [
        "シェイクスピア",
        "しかし、所詮は人間、いかに優れた者でも時には我を忘れます。",
    ],
    ["ディズニー", "しなくちゃいけない仕事には、何か楽しめる要素があるもの。"],
    ["ミルトン", "しばしの別離は再会をいっそう快いものにする。"],
    [
        "ジャーミー",
        "しゃべったことより、しゃべらずにいたことのほうが力がある。",
    ],
    ["バイロン", "ずいぶん敵も持ったけど、妻よ、お前のようなヤツは初めてだ。"],
    ["本田宗一郎", "すぐれたジョークは、すぐれたアイデアに通じる。"],
    ["マルティアリス", "すべての日がそれぞれの贈り物をもっている。"],
    ["ソロー", "すべての不幸は未来への踏み台にすぎない。"],
    ["トーマス・エジソン", "すべては、待っている間に頑張った人のもの。"],
    [
        "マーフィー",
        "すべては原因、結果の法則によります。運命論者のいう運・不運は、貴方の思考や行動と無縁ではない。",
    ],
    [
        "ゲーテ",
        "すべてをいますぐに知ろうとは無理なこと。雪が解ければ見えてくる。",
    ],
    ["スタール夫人", "すべてを納得すれば、心はきわめて寛大になる。"],
    [
        "徳川秀忠",
        "すべて軍陣などに臨みて面白しとだに思えば、恐ろしきとこも失せて、自ら計策も出てくるなれ。",
    ],
    [
        "山本常朝",
        "すべて人の不仕合せの時、別けて立ち入り、見舞い、付け届けつかまつるべきなり。",
    ],
    [
        "シーラ・グレアム",
        "ぜがひでも欲しいと思うものは何でも得られる。それには皮膚から噴き上げ、世界を創造したエネルギーと合流する、あふれんばかりの熱情でそれを望まなければならない。",
    ],
    ["アイスキュロス", "そうあるべきことは、やがてそうなっていくだろう。"],
]);
