const newline = require("./newline");
// 论述
module.exports = [
    "既然如此，",
    "那么，",
    "我认为，",
    "一般来说，",
    "总的来说，",
    "经过上述讨论，",
    "解决{主题}的问题，首先要找到抓手。所以，",
    "每个人都不得不复盘这些问题。在拉通对齐这种问题时，",
    "而这些问题并不是痛点，我们需要聚焦的关键是，",
    "带着这些问题，我们来聚焦一下——{主题}，",
    "{主题}的抓手是什么？方法论又该如何寻找？",
    "{主题}的打法，到底是怎样的，而聚焦{主题}本身，又会沉淀出什么样的方法论？",
    "要想清楚，{主题}，到底是对标一种什么样的存在？",
    "{主题}，到底到底该如何落地？",
    // newline phrases
    newline("了解清楚{主题}到底存在于哪条赛道，是解决一切问题的痛点。"),
    newline("打造业务和数据的闭环对{主题}的解决意义重大。"),
    newline("我们都必须串联相关生态，去思考有关{主题}的问题。"),
    newline("我们认为，找到抓手，形成方法论，{主题}则会迎刃而解。"),
    newline("所谓{主题}，关键是{主题}如何才能赋能目标，进而反哺目标生态。"),
];
